БухЭксп/Catalogs/CW_ВнешниеПодписки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ВнешниеПодписки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПодписки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыВнешнихПодписок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетаданноеПодписки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_МетаданныеКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсточникиПодписки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Метаданное</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_МетаданныеКонфигурации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ВнешниеПодписки/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьМетаданныеПодписки(ЭлементПодписки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ВнешниеПодпискиИсточникиПодписки.Метаданное КАК Метаданное
	               |ИЗ
	               |	Справочник.CW_ВнешниеПодписки.ИсточникиПодписки КАК CW_ВнешниеПодпискиИсточникиПодписки
	               |ГДЕ
	               |	CW_ВнешниеПодпискиИсточникиПодписки.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ЭлементПодписки);
	
	МассивМетаданных = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Метаданное");
	
	Возврат МассивМетаданных;
	
КонецФункции

Функция ПолучитьДанныеВнешнейПдписки(ОбработкаПодписки) Экспорт
	
	СтруктураДанных = Новый Структура("ВидПодписки, МетаданныеПодписки, Версия",Перечисления.CW_ВидыВнешнихПодписок.ПустаяСсылка(), Новый массив, "");
	
	ВнешняяОбработка 	= _ПО.ПолучитьОбработку(ОбработкаПодписки);
	
	Попытка 
		СтруктураДанныхПодписки = ВнешняяОбработка.Информация();
		
		Если  СтруктураДанныхПодписки.Свойство("ИмяВидаПодписки") Тогда
			СтруктураДанных.ВидПодписки =  Перечисления.CW_ВидыВнешнихПодписок[СтруктураДанныхПодписки.ИмяВидаПодписки];
		КонецЕсли;
		
		Если  СтруктураДанныхПодписки.Свойство("МетаданныеПодписки") Тогда
			Для каждого МетаданноеПодписки из СтруктураДанныхПодписки.МетаданныеПодписки Цикл
				СтруктураДанных.МетаданныеПодписки.добавить(CW_Обмены_ПИ.МетаданноеКонфигурации(МетаданноеПодписки));
			КонецЦикла;
		КонецЕсли;
		
		Если  СтруктураДанныхПодписки.Свойство("Версия") Тогда
			СтруктураДанных.Версия = СтруктураДанныхПодписки.Версия;
		КонецЕсли;
		
	Исключение
	КонецПопытки;
	
	Возврат СтруктураДанных;
	
КонецФункции

#КонецЕсли
